# Python Tutorial
## Week 6 Pandas
### Zongcheng Chu
### 2/19/2020

## Series

Series is a one-dimensional labeled array capable of holding data of any type (integer, string, float, python objects, etc.). The axis labels are collectively called index.

In [1]:
import pandas as pd
import numpy as np

data = np.array(['a','b','c','d'])
s = pd.Series(data)
print(s)

0    a
1    b
2    c
3    d
dtype: object

In [0]:
# set index
data = np.array(['a','b','c','d'])
s = pd.Series(data,index=[100,101,102,103])
print(s)

100    a
101    b
102    c
103    d
dtype: object

In [0]:
# create series from a dictionary
data = {'a' : 0., 'b' : 1., 'c' : 2.}
s = pd.Series(data)
print(s)

a    0.0
b    1.0
c    2.0
dtype: float64

In [0]:
# create series from scalar
import pandas as pd
import numpy as np
s = pd.Series(5, index=[0, 1, 2, 3])
print(s)

0    5
1    5
2    5
3    5
dtype: int64

## Accessing data from series

In [0]:
s = pd.Series([1,2,3,4,5],index = ['a','b','c','d','e'])

#get first element
print(s[0])

print("-"*30)

# get first three element
print(s[:3])

1
------------------------------
a    1
b    2
c    3
dtype: int64

In [0]:
# set values by index label
s = pd.Series([1,2,3,4,5],index = ['a','b','c','d','e'])

#retrieve multiple elements
print(s[['a','c','d']])

a    1
c    3
d    4
dtype: int64

## Dataframe

In [0]:
# create dataframe from a list
data = [['Alex',10],['Bob',12],['Clarke',13]]
df = pd.DataFrame(data,columns=['Name','Age'])
print(df)

     Name  Age
0    Alex   10
1     Bob   12
2  Clarke   13

In [0]:
# create dataframe from a dictionary
data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],'Age':[28,34,29,42]}
df = pd.DataFrame(data)
print(df)

    Name  Age
0    Tom   28
1   Jack   34
2  Steve   29
3  Ricky   42

In [0]:
# create dataframe from series
d = {'one' : pd.Series([5, 6, 7, 8], index=['a', 'b', 'c','d']),
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)
print(df)

   one  two
a    5    1
b    6    2
c    7    3
d    8    4

## Accessing data from dataframe

In [0]:
# Column Selection
d = {'one' : pd.Series([11, 22, 33, 44], index=['a', 'b', 'c','d']),
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)
print(df['one'])

a    11
b    22
c    33
d    44
Name: one, dtype: int64

In [0]:
# Column Addition
d = {'one' : pd.Series([1, 2, 3,4], index=['a', 'b', 'c','d']),
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)

# Adding a new column to an existing DataFrame object with column label by passing new series
df['three']=pd.Series([10,20,30,40],index=['a','b','c','d'])

df['four']=df['one']+df['three']

print(df)

   one  two  three  four
a    1    1     10    11
b    2    2     20    22
c    3    3     30    33
d    4    4     40    44

In [0]:
# Column deletion
d = {'one' : pd.Series([1, 2, 3,4], index=['a', 'b', 'c','d']), 
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd']), 
   'three' : pd.Series([10,20,30,40], index=['a','b','c','d'])}

df = pd.DataFrame(d)


# using del function
del df['one']
print(df)

# using pop function
df.pop('two')
print(df)

   two  three
a    1     10
b    2     20
c    3     30
d    4     40
   three
a     10
b     20
c     30
d     40

In [0]:
# row selection by label
d = {'one' : pd.Series([11, 22, 33, 44], index=['a', 'b', 'c','d']), 
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)
print(df)
print(df.loc['b'])

   one  two
a   11    1
b   22    2
c   33    3
d   44    4
one    22
two     2
Name: b, dtype: int64

In [0]:
#selection by integer location
d = {'one' : pd.Series([11, 22, 33, 44], index=['a', 'b', 'c','d']),
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)
print(df)
print(df.iloc[2])

   one  two
a   11    1
b   22    2
c   33    3
d   44    4
one    33
two     3
Name: c, dtype: int64

In [0]:
# Slice Rows
# Multiple rows can be selected using ‘ : ’ operator.
d = {'one' : pd.Series([11, 22, 33, 44], index=['a', 'b', 'c','d']),
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)
print(df[2:4])

   one  two
c   33    3
d   44    4

In [0]:
# deletion of rows
df = pd.DataFrame([[1, 2], [3, 4]], columns = ['a','b'])
print(df)

print("-"*30)
# Drop rows with label 0
df = df.drop(0)
print(df)

   a  b
0  1  2
1  3  4
------------------------------
   a  b
1  3  4

## Basic Functionality

In [0]:
#size
#Returns the size(length) of the series.

#Create a series with 4 random numbers
s = pd.Series(np.random.randn(4))
print(s)
print ("The size of the object:")
print(s.size)

0   -0.643456
1    0.395074
2   -0.675197
3    0.083673
dtype: float64
The size of the object:
4

In [0]:
#values
#Returns the actual data in the series as an array.
s = pd.Series(np.random.randn(4))
s.values

array([-0.72977152, -0.93274563, -0.39415613, -0.02808291])

In [0]:
#T (Transpose)
#Returns the transpose of the DataFrame. The rows and columns will interchange.

d = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack']),
   'Age':pd.Series([25,26,25,23,30,29,23]),
   'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8])}

# Create a DataFrame
df = pd.DataFrame(d)
print ("The original data series is:")
print(df)
print ("The transpose of the data series is:")
print(df.T)

The original data series is:
    Name  Age  Rating
0    Tom   25    4.23
1  James   26    3.24
2  Ricky   25    3.98
3    Vin   23    2.56
4  Steve   30    3.20
5  Smith   29    4.60
6   Jack   23    3.80
The transpose of the data series is:
           0      1      2     3      4      5     6
Name     Tom  James  Ricky   Vin  Steve  Smith  Jack
Age       25     26     25    23     30     29    23
Rating  4.23   3.24   3.98  2.56    3.2    4.6   3.8

In [0]:
# shape
#Returns a tuple representing the dimensionality of the DataFrame. 
#Tuple (a,b), where a represents the number of rows and b represents the number of columns.
df.shape

(7, 3)

In [0]:
# values
# Returns the actual data in the DataFrame as an NDarray.
df.values

array([['Tom', 25, 4.23],
       ['James', 26, 3.24],
       ['Ricky', 25, 3.98],
       ['Vin', 23, 2.56],
       ['Steve', 30, 3.2],
       ['Smith', 29, 4.6],
       ['Jack', 23, 3.8]], dtype=object)

In [0]:
# head
df.head(2)

    Name  Age  Rating
0    Tom   25    4.23
1  James   26    3.24

In [0]:
#tail
df.tail(2)

    Name  Age  Rating
5  Smith   29     4.6
6   Jack   23     3.8

## Descriptive Statistics

In [0]:
#Create a Dictionary of series
d = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack',
   'Lee','David','Gasper','Betina','Andres']),
   'Age':pd.Series([25,26,25,23,30,29,23,34,40,30,51,46]),
   'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8,3.78,2.98,4.80,4.10,3.65])
}

#Create a DataFrame
df = pd.DataFrame(d)
print(df)

      Name  Age  Rating
0      Tom   25    4.23
1    James   26    3.24
2    Ricky   25    3.98
3      Vin   23    2.56
4    Steve   30    3.20
5    Smith   29    4.60
6     Jack   23    3.80
7      Lee   34    3.78
8    David   40    2.98
9   Gasper   30    4.80
10  Betina   51    4.10
11  Andres   46    3.65

In [0]:
# sum()
# Returns the sum of the values for the requested axis. By default, axis is index (axis=0).
df.sum()

Name      TomJamesRickyVinSteveSmithJackLeeDavidGasperBe...
Age                                                     382
Rating                                                44.92
dtype: object

In [0]:
df.sum(1) # on a row level

0     29.23
1     29.24
2     28.98
3     25.56
4     33.20
5     33.60
6     26.80
7     37.78
8     42.98
9     34.80
10    55.10
11    49.65
dtype: float64

In [0]:
#mean()
#Returns the average value
df.mean()

Age       31.833333
Rating     3.743333
dtype: float64

In [0]:
# std()
df.std()

Age       9.232682
Rating    0.661628
dtype: float64

In [0]:
df.max()

Name      Vin
Age        51
Rating    4.8
dtype: object

In [0]:
df.min()

Name      Andres
Age           23
Rating      2.56
dtype: object

In [0]:
df.median()

Age       29.50
Rating     3.79
dtype: float64

In [0]:
# Summarizing Data
# The describe() function computes a summary of statistics pertaining to the DataFrame columns.
df.describe()

             Age     Rating
count  12.000000  12.000000
mean   31.833333   3.743333
std     9.232682   0.661628
min    23.000000   2.560000
25%    25.000000   3.230000
50%    29.500000   3.790000
75%    35.500000   4.132500
max    51.000000   4.800000

## Rename

In [0]:
df1 = pd.DataFrame(np.random.randn(6,3),columns=['col1','col2','col3'])
print(df1)

print ("After renaming the rows and columns:")
df1.rename(columns={'col1' : 'c1', 'col2' : 'c2'},index = {0 : 'apple', 1 : 'banana', 2 : 'durian'})

       col1      col2      col3
0  0.247696 -0.997520  0.626368
1  0.483043 -1.204707  0.833685
2 -0.357949 -0.231965 -1.397834
3  1.225137  0.311912 -0.762000
4 -1.500123  0.853652 -0.451185
5 -1.189524  0.829433  0.982848
After renaming the rows and columns:

              c1        c2      col3
apple   0.247696 -0.997520  0.626368
banana  0.483043 -1.204707  0.833685
durian -0.357949 -0.231965 -1.397834
3       1.225137  0.311912 -0.762000
4      -1.500123  0.853652 -0.451185
5      -1.189524  0.829433  0.982848

## Iteration

In [0]:
# Iterating a DataFrame gives column names
N=20
df = pd.DataFrame({
   'A': pd.date_range(start='2016-01-01',periods=N,freq='D'),
   'x': np.linspace(0,stop=N-1,num=N),
   'y': np.random.rand(N),
   'C': np.random.choice(['Low','Medium','High'],N).tolist(),
   'D': np.random.normal(100, 10, size=(N)).tolist()
   })

print(df)
print("printing column names")
for col in df:
    print(col)

            A     x         y       C           D
0  2016-01-01   0.0  0.909765  Medium  108.031332
1  2016-01-02   1.0  0.111406     Low   92.066900
2  2016-01-03   2.0  0.002837  Medium  103.218086
3  2016-01-04   3.0  0.735447    High  102.956832
4  2016-01-05   4.0  0.968383    High  109.755968
5  2016-01-06   5.0  0.308518     Low  105.722324
6  2016-01-07   6.0  0.203941  Medium  110.715550
7  2016-01-08   7.0  0.843251  Medium  104.952474
8  2016-01-09   8.0  0.323754     Low   77.060194
9  2016-01-10   9.0  0.748270  Medium   99.644270
10 2016-01-11  10.0  0.743663    High   85.642198
11 2016-01-12  11.0  0.847792  Medium  112.255562
12 2016-01-13  12.0  0.198488     Low   91.197233
13 2016-01-14  13.0  0.759532    High  108.743730
14 2016-01-15  14.0  0.951543     Low  104.363137
15 2016-01-16  15.0  0.838933    High   84.177280
16 2016-01-17  16.0  0.440585     Low  121.712505
17 2016-01-18  17.0  0.404359    High  100.131619
18 2016-01-19  18.0  0.231786    High   83.983749
19 2016-01-20  19.0  0.561849     Low  107.537011
printing column names
A
x
y
C
D

In [0]:
# To iterate over the rows of the DataFrame
for row in df.iterrows():
    print(row[1]['C'])

Medium
Low
Medium
High
High
Low
Medium
Medium
Low
Medium
High
Medium
Low
High
Low
High
Low
High
High
Low

## Sorting

In [0]:
unsorted_df=pd.DataFrame(np.random.randn(10,2),index=[1,4,6,2,3,5,9,8,0,7],columns=['col2','col1'])
print(unsorted_df)

       col2      col1
1  0.330783  1.356848
4  0.882037  1.530766
6  0.784493  0.397434
2  0.328289  0.232696
3 -0.507618  0.939422
5  0.242022 -1.147194
9 -1.456935  1.812756
8  2.237754 -1.468803
0  0.885650  1.355595
7  0.217845  0.102969

In [0]:
sorted_df = unsorted_df.sort_values(by='col1')
sorted_df

       col2      col1
8  2.237754 -1.468803
5  0.242022 -1.147194
7  0.217845  0.102969
2  0.328289  0.232696
6  0.784493  0.397434
3 -0.507618  0.939422
0  0.885650  1.355595
1  0.330783  1.356848
4  0.882037  1.530766
9 -1.456935  1.812756

In [0]:
sorted_df = unsorted_df.sort_values(by='col1', ascending=False)
sorted_df

       col2      col1
9 -1.456935  1.812756
4  0.882037  1.530766
1  0.330783  1.356848
0  0.885650  1.355595
3 -0.507618  0.939422
6  0.784493  0.397434
2  0.328289  0.232696
7  0.217845  0.102969
5  0.242022 -1.147194
8  2.237754 -1.468803

## Mapping Data

In [0]:
df = pd.DataFrame({'item':['ball', 'mug', 'pen', 'pencil', 'ashtray'],
                      'price':[1, 2, 3, 4, 5]})
print(df)
df.price = df.price.map(lambda x: x + 1)
df

      item  price
0     ball      1
1      mug      2
2      pen      3
3   pencil      4
4  ashtray      5

      item  price
0     ball      2
1      mug      3
2      pen      4
3   pencil      5
4  ashtray      6

In [0]:
df = pd.DataFrame({'item':['ball', 'mug', 'pen', 'pencil', 'ashtray'],
                      'price':[1, 2, 3, 4, 5]})
print(df)

maps = {1:"Strongly Disagree",2:"Disagree",3:"Neutral",4:"Agree",5:"Strongly Agree"}
df["scale"] = df.price.map(maps)
df

      item  price
0     ball      1
1      mug      2
2      pen      3
3   pencil      4
4  ashtray      5

      item  price              scale
0     ball      1  Strongly Disagree
1      mug      2           Disagree
2      pen      3            Neutral
3   pencil      4              Agree
4  ashtray      5     Strongly Agree

## Selecting Data

In [0]:
# loc()
# loc takes two single/list/range operator separated by ','. 
# The first one indicates the row and the second one indicates columns.

df = pd.DataFrame(np.random.randn(8, 4),
index = ['a','b','c','d','e','f','g','h'], columns = ['A', 'B', 'C', 'D'])
print(df)

#select all rows for a specific column
df.loc[:,'A']

          A         B         C         D
a  0.708633 -0.377059  0.791805 -0.247001
b -0.793903  1.435243 -0.977261  2.717676
c  2.512481 -1.427591  0.590483  0.498605
d  0.686299 -1.629100 -0.631537 -0.548331
e  1.041686 -0.803465  0.508428  2.172501
f -0.026731 -0.966350 -1.152908 -0.364991
g -0.085008  0.384339  0.613961 -1.589249
h -0.251855  0.275211 -0.922785  1.654489

a    0.708633
b   -0.793903
c    2.512481
d    0.686299
e    1.041686
f   -0.026731
g   -0.085008
h   -0.251855
Name: A, dtype: float64

In [0]:
# Select all rows for multiple columns, say list[]
df.loc[:,['A','C']]

          A         C
a  0.708633  0.791805
b -0.793903 -0.977261
c  2.512481  0.590483
d  0.686299 -0.631537
e  1.041686  0.508428
f -0.026731 -1.152908
g -0.085008  0.613961
h -0.251855 -0.922785

In [0]:
# Select few rows for multiple columns, say list[]
df.loc[['a','b','f','h'],['A','C']]

          A         C
a  0.708633  0.791805
b -0.793903 -0.977261
f -0.026731 -1.152908
h -0.251855 -0.922785

In [0]:
# iloc()
df = pd.DataFrame(np.random.randn(8, 4), columns = ['A', 'B', 'C', 'D'])
print(df)

# select rows(0,1,2,3) for all columns
df.iloc[:4]

          A         B         C         D
0 -0.624857 -1.249300  0.809063  0.061812
1 -1.079665 -0.746837 -1.263361 -1.567046
2 -0.213776 -0.701055  1.982911 -1.383959
3 -0.099048  0.148414  0.374658  0.404633
4  0.311073  0.302397  1.063568  0.347607
5  0.604660 -2.341612  0.176572 -0.088469
6  2.208907  0.015250 -0.156084  1.376597
7  0.328269  0.378291 -0.519350  0.572462

          A         B         C         D
0 -0.624857 -1.249300  0.809063  0.061812
1 -1.079665 -0.746837 -1.263361 -1.567046
2 -0.213776 -0.701055  1.982911 -1.383959
3 -0.099048  0.148414  0.374658  0.404633

In [0]:
df = pd.DataFrame(np.random.randn(8, 4), columns = ['A', 'B', 'C', 'D'])

# Integer slicing
print(df.iloc[:4])
df.iloc[1:5, 2:4]

          A         B         C         D
0 -0.438098 -0.291441 -0.035516 -0.080188
1  0.425289  0.646466  0.139807 -0.086836
2  0.500887 -0.715578 -0.092785  0.743226
3  1.673269 -0.597281 -1.432426 -0.988941

          C         D
1  0.139807 -0.086836
2 -0.092785  0.743226
3 -1.432426 -0.988941
4 -0.509556  0.276629

In [0]:
df = pd.DataFrame(np.random.randn(8, 4), columns = ['A', 'B', 'C', 'D'])

# Slicing through list of values
print(df.iloc[[1, 3, 5], [1, 3]])
print(df.iloc[1:3, :])
print(df.iloc[:,1:3])

          B         D
1 -2.529830  0.366486
3 -1.936597  1.484488
5 -1.425305  0.137900
          A         B         C         D
1 -1.029516 -2.529830 -0.360313  0.366486
2  0.607627  0.164292  0.597521 -1.971126
          B         C
0 -0.513967 -1.066167
1 -2.529830 -0.360313
2  0.164292  0.597521
3 -1.936597 -0.652263
4 -1.907082 -1.658401
5 -1.425305 -1.429624
6 -0.141127  0.811319
7  1.167713  1.362293

In [0]:
# get data by column names

df = pd.DataFrame(np.random.randn(8, 4), columns = ['A', 'B', 'C', 'D'])

df[['A','B']]

          A         B
0 -0.221181  0.587036
1  0.042736  2.719581
2 -0.896029 -1.234506
3 -1.080779  0.657993
4  0.940850 -1.524256
5 -0.857611 -0.969800
6  0.102091  0.164080
7 -0.127962 -0.307379

In [0]:
#Attribute Access
#Columns can be selected using the attribute operator '.'.
df.A

0   -0.221181
1    0.042736
2   -0.896029
3   -1.080779
4    0.940850
5   -0.857611
6    0.102091
7   -0.127962
Name: A, dtype: float64

## Missing Data

In [0]:
df = pd.DataFrame(np.random.randn(5, 3), index=['a', 'c', 'e', 'f','h'],columns=['one', 'two', 'three'])

df = df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])

df

        one       two     three
a  0.641504  1.538097  0.197480
b       NaN       NaN       NaN
c -0.738784  1.771795 -0.174851
d       NaN       NaN       NaN
e  0.721065 -1.137984  1.141446
f -1.564579  1.391001 -0.818807
g       NaN       NaN       NaN
h  0.127696 -0.737376  0.700805

In [0]:
# Check for Missing Values
df['one'].isnull()

a    False
b     True
c    False
d     True
e    False
f    False
g     True
h    False
Name: one, dtype: bool

In [0]:
# Calculations with Missing Data
# 1. When summing data, NA will be treated as Zero
# 2. If the data are all NA, then the result will be NA
df['one'].sum()

-0.8130973032806629

In [0]:
# Cleaning / Filling Missing Data
# replace NA with 0

df = pd.DataFrame(np.random.randn(3, 3), index=['a', 'c', 'e'],columns=['one',
'two', 'three'])

df = df.reindex(['a', 'b', 'c'])

print(df)
print ("NaN replaced with '0':")
df.fillna(0)

        one       two     three
a  0.211271  0.030430 -0.452256
b       NaN       NaN       NaN
c  1.589002  0.373146 -0.553134
NaN replaced with '0':

        one       two     three
a  0.211271  0.030430 -0.452256
b  0.000000  0.000000  0.000000
c  1.589002  0.373146 -0.553134

In [0]:
# Drop Missing Values
# dropna()
# By default, axis=0, i.e., along row, which means that if any value within a row is NA then the whole row is excluded.

df = pd.DataFrame(np.random.randn(5, 3), index=['a', 'c', 'e', 'f',
'h'],columns=['one', 'two', 'three'])

df = df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])
print(df)
df.dropna()

        one       two     three
a  0.819213 -0.664838  0.068982
b       NaN       NaN       NaN
c -1.739407 -1.677461 -0.221483
d       NaN       NaN       NaN
e  1.204050  0.227922  0.513837
f -0.222621 -1.223031 -1.055109
g       NaN       NaN       NaN
h  1.261528  0.281814 -0.113019

        one       two     three
a  0.819213 -0.664838  0.068982
c -1.739407 -1.677461 -0.221483
e  1.204050  0.227922  0.513837
f -0.222621 -1.223031 -1.055109
h  1.261528  0.281814 -0.113019

In [0]:
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [a, b, c, d, e, f, g, h]

In [0]:
# replace value
df = pd.DataFrame({'one':[10,20,30,40,50,2000], 'two':[1000,0,30,40,50,60]})
print(df)
df.replace({1000:20,2000:60})

    one   two
0    10  1000
1    20     0
2    30    30
3    40    40
4    50    50
5  2000    60

   one  two
0   10   20
1   20    0
2   30   30
3   40   40
4   50   50
5   60   60

## Group Data

In [0]:
data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
   'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
   'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
   'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
   'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(data)
df

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [0]:
df.groupby('Team').groups

{'Devils': Int64Index([2, 3], dtype='int64'),
 'Kings': Int64Index([4, 6, 7], dtype='int64'),
 'Riders': Int64Index([0, 1, 8, 11], dtype='int64'),
 'Royals': Int64Index([9, 10], dtype='int64'),
 'kings': Int64Index([5], dtype='int64')}

In [0]:
# Group by multiple columns
df.groupby(['Team','Year']).groups

{('Devils', 2014): Int64Index([2], dtype='int64'),
 ('Devils', 2015): Int64Index([3], dtype='int64'),
 ('Kings', 2014): Int64Index([4], dtype='int64'),
 ('Kings', 2016): Int64Index([6], dtype='int64'),
 ('Kings', 2017): Int64Index([7], dtype='int64'),
 ('Riders', 2014): Int64Index([0], dtype='int64'),
 ('Riders', 2015): Int64Index([1], dtype='int64'),
 ('Riders', 2016): Int64Index([8], dtype='int64'),
 ('Riders', 2017): Int64Index([11], dtype='int64'),
 ('Royals', 2014): Int64Index([9], dtype='int64'),
 ('Royals', 2015): Int64Index([10], dtype='int64'),
 ('kings', 2015): Int64Index([5], dtype='int64')}

In [0]:
# Iterating through Groups

grouped = df.groupby('Year')

for name,group in grouped:
    print(name)
    print(group)

2014
     Team  Rank  Year  Points
0  Riders     1  2014     876
2  Devils     2  2014     863
4   Kings     3  2014     741
9  Royals     4  2014     701
2015
      Team  Rank  Year  Points
1   Riders     2  2015     789
3   Devils     3  2015     673
5    kings     4  2015     812
10  Royals     1  2015     804
2016
     Team  Rank  Year  Points
6   Kings     1  2016     756
8  Riders     2  2016     694
2017
      Team  Rank  Year  Points
7    Kings     1  2017     788
11  Riders     2  2017     690

In [0]:
# Select a Group

grouped = df.groupby('Year')
grouped.get_group(2014)

     Team  Rank  Year  Points
0  Riders     1  2014     876
2  Devils     2  2014     863
4   Kings     3  2014     741
9  Royals     4  2014     701

In [0]:
# Aggregations

# Once the group by object is created, 
# several aggregation operations can be performed on the grouped data.

grouped = df.groupby('Year')
grouped['Points'].agg(np.mean)

Year
2014    795.25
2015    769.50
2016    725.00
2017    739.00
Name: Points, dtype: float64

In [0]:
grouped = df.groupby('Team')
for name,group in grouped:
    print(name)
    print(group)

print("-"*30)
print(grouped['Points'].agg([np.sum, np.mean, np.std]))

Devils
     Team  Rank  Year  Points
2  Devils     2  2014     863
3  Devils     3  2015     673
Kings
    Team  Rank  Year  Points
4  Kings     3  2014     741
6  Kings     1  2016     756
7  Kings     1  2017     788
Riders
      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
8   Riders     2  2016     694
11  Riders     2  2017     690
Royals
      Team  Rank  Year  Points
9   Royals     4  2014     701
10  Royals     1  2015     804
kings
    Team  Rank  Year  Points
5  kings     4  2015     812
------------------------------
         sum        mean         std
Team
Devils  1536  768.000000  134.350288
Kings   2285  761.666667   24.006943
Riders  3049  762.250000   88.567771
Royals  1505  752.500000   72.831998
kings    812  812.000000         NaN

## Read csv/xlsx

In [0]:
df = pd.read_csv("titanic.csv")
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [0]:
df = pd.read_excel("Q1data")
g = df.groupby("section")
df.head(5)

,Timestamp,Date,Student,Academic status,section,scale,Value
0,2019/09/10 10:01:55 AM EST,43718.0,Student_5283,Sophomore,CGT 27000-001 (Tuesday/Thursday),Strongly agree,3
1,2019/09/10 10:03:45 AM EST,43718.0,Student_5337,NaN,CGT 27000-001 (Tuesday/Thursday),Agree,4
2,2019/09/10 10:04:24 AM EST,43718.0,Student_7502,NaN,CGT 27000-001 (Tuesday/Thursday),Agree,4
3,2019/09/15 3:17:09 AM EST,43723.0,Student_5798,Sophomore,CGT 27000-001 (Tuesday/Thursday),Agree,4
4,2019/09/15 10:59:48 PM EST,43723.0,Student_4522,Sophomore,CGT 27000-001 (Tuesday/Thursday),Neutral,3

In [0]:
g.get_group("CGT 27000-001 (Tuesday/Thursday)")["scale"].value_counts()

Agree             13
Neutral            4
Strongly agree     3
Disagree           1
Name: scale, dtype: int64

## Save Dataframe to a csv file

In [0]:
df = pd.DataFrame({'name': ['Raphael', 'Donatello'],
                   'mask': ['red', 'purple'],
                   'weapon': ['sai', 'bo staff']})
print(df)
df.to_csv("demo.csv", index=False)

        name    mask    weapon
0    Raphael     red       sai
1  Donatello  purple  bo staff

# Assignment (15 points)

### 1. Use your own spreadsheet(Q1) for practice. Read the excel sheet using Pandas.

In [32]:
df = pd.read_excel("Q1data.xlsx")
g = df.groupby("Section")
df.head(5)

                   Timestamp  ...              Q1
0  2019/09/25 9:21:54 AM EST  ...           Agree
1  2019/09/25 8:34:23 AM EST  ...  Strongly agree
2  2019/08/28 8:57:36 AM EST  ...         Neutral
3  2019/08/28 9:00:58 AM EST  ...         Neutral
4  2019/09/04 8:51:30 AM EST  ...           Agree

[5 rows x 7 columns]

### 2. check missing values for all the columns, if missing values exist, simply delete the entire row.

In [73]:
df['Date'].isnull()
df.dropna()

                     Timestamp       Date  ...              Q1 degree
0    2019/09/25 9:21:54 AM EST 2019-09-25  ...           Agree      4
1    2019/09/25 8:34:23 AM EST 2019-09-25  ...  Strongly agree      5
2    2019/08/28 8:57:36 AM EST 2019-08-28  ...         Neutral      3
3    2019/08/28 9:00:58 AM EST 2019-08-28  ...         Neutral      3
4    2019/09/04 8:51:30 AM EST 2019-09-04  ...           Agree      4
5    2019/08/28 8:56:16 AM EST 2019-08-28  ...           Agree      4
6    2019/08/28 9:02:11 AM EST 2019-08-28  ...           Agree      4
7    2019/08/28 9:02:14 AM EST 2019-08-28  ...           Agree      4
8    2019/09/04 8:50:48 AM EST 2019-09-04  ...           Agree      4
9    2019/08/28 8:56:05 AM EST 2019-08-27  ...         Neutral      3
10   2019/08/28 8:55:52 AM EST 2019-08-28  ...           Agree      4
11   2019/08/28 9:01:21 AM EST 2019-08-28  ...           Agree      4
12   2019/08/28 8:57:40 AM EST 2019-08-28  ...           Agree      4
13   2019/08/28 8:54:58 AM EST 2019-08-28  ...           Agree      4
14   2019/08/28 2:01:45 PM EST 2019-08-28  ...           Agree      4
16   2019/08/28 9:07:30 AM EST 2019-08-28  ...         Neutral      3
17   2019/08/28 9:24:56 AM EST 2019-08-28  ...           Agree      4
18   2019/08/28 8:54:57 AM EST 2019-08-28  ...           Agree      4
19   2019/08/28 8:56:18 AM EST 2019-08-28  ...           Agree      4
20   2019/08/28 8:43:59 AM EST 2019-08-28  ...           Agree      4
21   2019/08/28 8:58:39 AM EST 2019-08-28  ...           Agree      4
22   2019/08/28 9:00:07 AM EST 2019-08-28  ...           Agree      4
23  2019/08/27 11:24:49 PM EST 2019-08-28  ...           Agree      4
24  2019/08/27 10:23:43 AM EST 2019-08-27  ...           Agree      4
25  2019/08/27 10:56:52 AM EST 2019-08-27  ...           Agree      4
26  2019/09/24 10:09:15 AM EST 2019-09-24  ...           Agree      4
27  2019/09/16 10:31:57 PM EST 2019-09-16  ...           Agree      4
28  2019/08/27 10:20:47 AM EST 2019-08-27  ...           Agree      4
29  2019/09/11 12:13:45 PM EST 2019-09-11  ...        Disagree      2
30  2019/08/27 10:27:15 AM EST 2019-08-27  ...           Agree      4
31  2019/08/27 11:33:09 AM EST 2019-08-27  ...         Neutral      3
32  2019/09/10 10:01:38 AM EST 2019-09-10  ...         Neutral      3
33  2019/08/27 10:21:54 AM EST 2019-08-27  ...           Agree      4
34   2019/08/28 5:54:31 PM EST 2019-08-28  ...         Neutral      3
35   2019/09/15 3:00:26 AM EST 2019-09-15  ...         Neutral      3
36  2019/08/27 10:11:39 AM EST 2019-08-27  ...         Neutral      3
37  2019/08/27 10:21:37 AM EST 2019-08-27  ...           Agree      4
38  2019/08/27 10:23:24 AM EST 2019-08-27  ...           Agree      4
39  2019/08/27 11:40:30 AM EST 2019-08-27  ...         Neutral      3
41   2019/09/24 7:45:41 PM EST 2019-09-24  ...         Neutral      3
42  2019/09/10 10:02:20 AM EST 2019-09-10  ...           Agree      4
43  2019/08/27 11:58:10 AM EST 2019-08-27  ...           Agree      4
44   2019/09/24 9:06:35 PM EST 2019-09-24  ...           Agree      4

[43 rows x 8 columns]

### 3. Map the Likert Score to {1:"Strongly Disagree",2:"Disagree",3:"Neutral",4:"Agree",5:"Strongly Agree"}
### create another column called "degree" for these new values.

In [72]:
maps = {"Strongly disagree":1,"Disagree":2,"Neutral":3,"Agree":4,"Strongly agree":5}
df["degree"] = df.Q1.map(maps)
df.head(5)

                   Timestamp       Date  ...              Q1 degree
0  2019/09/25 9:21:54 AM EST 2019-09-25  ...           Agree      4
1  2019/09/25 8:34:23 AM EST 2019-09-25  ...  Strongly agree      5
2  2019/08/28 8:57:36 AM EST 2019-08-28  ...         Neutral      3
3  2019/08/28 9:00:58 AM EST 2019-08-28  ...         Neutral      3
4  2019/09/04 8:51:30 AM EST 2019-09-04  ...           Agree      4

[5 rows x 8 columns]

### 4. Group the data by different sections and compute the mean, median and std for each section

In [71]:
main = df
LC = df.iloc[:23]
print(LC['degree'].mean())
print(LC['degree'].median())
LC['degree'].std()

3.869565217391304
4.0

0.45769658728016005

In [70]:
main = df.iloc[23:]
print(main['degree'].mean())
print(main['degree'].median())
main['degree'].std()

3.5454545454545454
4.0

0.5958006000151015

### 5. Group the data by different sections and report the student count for each likert score in each section.

In [31]:
g.get_group("CGT 2700-LC (Wednesday/Friday)")["Q1"].value_counts()

Agree             18
Neutral            4
Strongly agree     1
Name: Q1, dtype: int64

In [30]:
g.get_group("CGT2700-001 (Tuesday/Thursday)")["Q1"].value_counts()

Agree       13
Neutral      8
Disagree     1
Name: Q1, dtype: int64